import $ from 'jquery';
require("jquery-mousewheel");
//require('malihu-custom-scrollbar-plugin');
//import fancybox from 'fancybox';
//fancybox($);

$(document).ready(function () {
    $('#biogen__button').click(function () {
    /**
     * Переменные гидробионтов
     * Ci (i=1-8) - относится к водной среде
     */
    var C1 = Number($('#FH').val());     // (FH) - рыбы;
    var C2 = Number($('#ZO').val());     // (ZO) - зоопланктон;
    var C3 = Number($('#MF').val());     // (MF) - макрофиты;
    var C4 = Number($('#PH').val());     // (PH) - фитопланктон;
    var C5 = Number($('#BA').val());     // (BA) - бактерии;
    var C6 = Number($('#MP').val());     // (MP) - минеральный фосфор;
    var C7 = Number($('#DO').val());     // (DO) - растворимый органический фосфор;
    var C8 = Number($('#DE').val());     // (DE) - детритный фосфор;
    var C9 = Number($('#IP').val());     // (IP) - интерстициальный фосфор;




        console.log(C1,C2,C3,C4,C5,C6,C7,C8,C9);
        console.log("------------------------------------");

        /**
         * i=1: Для рыбы elements
         * Рацион:
         * Фитопланктон: C4 (PH);
         * Зоопланктон: C2 (ZO);
         * Детрит: C8 (DE);
         * Макрофиты: C3 (MF);
         */


        /**
         * Коэффициенты потребления
         */
        var d11 = 1;
        var d12 = 1;
        var d13 = 1;
        var d14 = 1;
        var d15 = 1;
        var d16 = 1;
        var d17 = 1;
        var d18 = 1;

        var k1 = 1;

        var F1 = d12*C2 + d13*C3 + d14*C4 + d18*C8;

        /* Удельная скорость потребления */
        var U12 = (k1*d12*C2)/(F1 + C1);
        var U13 = (k1*d13*C3)/(F1 + C1);
        var U14 = (k1*d14*C4)/(F1 + C1);
        var U18 = (k1*d18*C8)/(F1 + C1);

        var U1 = U12 + U13 + U14 + U18;
        /* Скорость выделения */
        var R1 = (d11*U1)/(1 + d12*U1) + (1 - d11/d12);
        var L1 = R1*U1;

        /* Скорость смертности */
        var V11 = 1;
        var V12 = 1;
        var S1 = V11 + V12*(C1/U1);

        /* Скорость выедания */
        var Ct1 = 0; // В дальнейшем, когда будет учтен вылов рыбы человеком - бедет Ct1 != 0.

        console.log("------------------------------------");
        console.log("F1: "+F1);
        console.log("U12: "+U12);
        console.log("U13: "+U13);
        console.log("U14: "+U14);
        console.log("U18: "+U18);
        console.log("U1: "+U1);
        console.log("L1: "+L1);
        console.log("S1: "+S1);
        console.log("Ct1: "+Ct1);

        /**
         *  Конец i=1: Для рыбы elements.
         */

        /**
         * i=2: Для зоопланктона C2 = ZO
         * Рацион:
         * Фитопланктон: C4 (PH);
         * Бактерии: С5 (BA);
         * Детрит: C8 (DE);
         */

        /**
         * Коэффициенты потребления
         */
        var d21 = 1;
        var d22 = 1;
        var d23 = 1;
        var d24 = 1;
        var d25 = 1;
        var d26 = 1;
        var d27 = 1;
        var d28 = 1;

        var k2 = 1;

        var F2 = d24*C4 + d25*C5 + d28*C8;

        /* Удельная скорость потребления */
        var U24 = (k2*d24*C4)/(F2 + C2);
        var U25 = (k2*d25*C5)/(F2 + C2);
        var U28 = (k2*d28*C8)/(F2 + C2);

        var U2 = U24 + U25 + U28;

        /* Скорость выделения */
        var R2 = (d21*U2)/(1 + d22*U2) + (1 - d21/d22);
        var L2 = R2*U2;

        /* Скорость смертности */
        var V21 = 1;
        var V22 = 1;
        var S2 = V21 + V22*(C2/U2);

        /* Скорость выедания */
        var Ct2 = U12; // Выедания зоопланктона рыбой

        console.log("------------------------------------");
        console.log("F2: "+F2);
        console.log("U24: "+U24);
        console.log("U25: "+U25);
        console.log("U28: "+U28);
        console.log("U2: "+U2);
        console.log("L2: "+L2);
        console.log("S2: "+S2);
        console.log("Ct2: "+Ct2);

        /**
         *  Конец i=2: Для зоопланктона C2.
         */




        /**
         * i=3: Для макрофитов C3 = MF
         * Рацион:
         * Минеральный фосфор: C6 (MP);
         * Интерстициальный фосфор: С9 (IP);
         */

        /**
         * Коэффициенты потребления
         */
        var d31 = 1;
        var d32 = 1;
        var d33 = 1;
        var d34 = 1;
        var d35 = 1;
        var d36 = 1;
        var d37 = 1;
        var d38 = 1;
        var d39 = 1;

        var k3 = 1;

        var F3 = d36*C6 + d39*C9;

        /* Удельная скорость потребления */
        var U36 = (k3*d36*C6)/(F3 + C3);
        var U39 = (k3*d39*C9)/(F3 + C3);

        var U3 = U36 + U39;

        /* Скорость выделения */
        var R3 = (d31*U3)/(1 + d32*U3) + (1 - d31/d32);
        var L3 = R3*U3;

        /* Скорость смертности */
        var V31 = 1;
        var V32 = 1;
        var S3 = V31 + V32*(C3/U3);

        /* Скорость выедания */
        var Ct3 = U13; // Выедания макрофитов рыбой
        console.log("------------------------------------");
        console.log("F3: "+F3);
        console.log("U36: "+U36);
        console.log("U39: "+U39);
        console.log("U3: "+U3);
        console.log("L3: "+L3);
        console.log("S3: "+S3);
        console.log("Ct3: "+Ct3);

        /**
         *  Конец i=3: Для макрофитов C3.
         */


        /**
         * i=4: Для фитопланктона C4. (PH) - фитопланктон;
         * Рацион:
         * Минеральный фосфор: C6 (MP);
         */

        /**
         * Коэффициенты потребления
         */
        var d41 = 1;
        var d42 = 1;
        var d43 = 1;
        var d44 = 1;
        var d45 = 1;
        var d46 = 1;
        var d47 = 1;
        var d48 = 1;
        var d49 = 1;

        var k4 = 1;

        var F4 = C6;

        /* Удельная скорость потребления */
        var U46 = (k4)/(1 + C4/F4);
        var U4 = U46;

        /* Скорость выделения */
        var R4 = (d41*U4)/(1 + d42*U4) + (1 - d41/d42);
        var L4 = R4*U4;

        /* Скорость смертности */
        var V41 = 1;
        var V42 = 1;
        var S4 = V41 + V42*(C4/U4);

        /* Скорость выедания */
        var Ct4 = U24 + U14; // Выеданиея фитопланетона зоопланктоном и рыбой
        console.log("------------------------------------");
        console.log("F4: "+F4);
        console.log("U46: "+U46);
        console.log("U4: "+U4);
        console.log("L4: "+L4);
        console.log("S4: "+S4);
        console.log("Ct4: "+Ct4);

        /**
         *  Конец i=4: Для фитопланктона C4. (PH) - фитопланктон;
         */

        /**
         * i=5: Для бактерий C5. (BA) - бактерии;
         * Рацион:
         * Растворимый органический фосфор: C7 (DO);
         */

        /**
         * Коэффициенты потребления
         */
        var d51 = 1;
        var d52 = 1;
        var d53 = 1;
        var d54 = 1;
        var d55 = 1;
        var d56 = 1;
        var d57 = 1;
        var d58 = 1;
        var d59 = 1;

        var k5 = 1;

        var F5 = C7;

        /* Удельная скорость потребления */
        var U57 = (k5)/(1 + C5/F5);
        var U5 = U57;

        /* Скорость выделения */
        var R5 = (d51*U5)/(1 + d52*U5) + (1 - d51/d52);
        var L5 = R5*U5;

        /* Скорость смертности */
        var V51 = 1;
        var V52 = 1;
        var S5 = V51 + V52*(C5/U5);

        /* Скорость выедания */
        var Ct5 = U25; // Выеданиея фитопланетона зоопланктоном и рыбой
        console.log("------------------------------------");
        console.log("F5: "+F5);
        console.log("U57: "+U57);
        console.log("U5: "+U5);
        console.log("L5: "+L5);
        console.log("S5: "+S5);
        console.log("Ct5: "+Ct5);

        /**
         *  Конец i=5: Для бактерий C5. (BA) - бактерии;
         */
        
        
        




        /**
         * i=6: Для мнерального фосфора C6. (MP) - минеральный фосфор;
         */

        /**
         * Коэффициенты потребления
         */

        var k6 = 1;

        /* Скорость выделения */
        var R6 = -U4*C4 - U36*C3 + L5*C5;
        

        /* Скорость выедания */
        var Ct5 = U25; // Выеданиея фитопланетона зоопланктоном и рыбой
        console.log("------------------------------------");
        console.log("F5: "+F5);
        console.log("U57: "+U57);
        console.log("U5: "+U5);
        console.log("L5: "+L5);
        console.log("S5: "+S5);
        console.log("Ct5: "+Ct5);

        /**
         *  Конец i=6: Для мнерального фосфора C6. (MP) - минеральный фосфор;
         */



    });


    //
    //
    //
    // /**
    //  * Начальные значения переменных
    //  */
    //
    // var glubina = 8.2;  // Глубина водохранилища в м;
    // var L = 180;        // Длина в км = 180000 м;
    // var S = 1070;       // Площадь зеркала в км2;
    // var W = 8.8;        // Объем водохранилища в км3;
    //
    // /*Начальные значения переменных  "Уравнения для гидрохимических переменных" */
    //
    // //  W - объем водохранилищап
    // var t;              // - время
    // var Ri = 1;         // - скорость биохимической трасформации соответствующего соединения Ci, Q_+;
    // var C_plus_i = 1;   // - расход реки и концентрация компонентов в ней;
    // var Q_minus = 1;          // - расход попуска из водохранилища;
    // var Ji = 1;         // - массовый поток на межфазной поверхности;
    // // S - площадь зеркала водохранилища;
    // var Ei = 1;         // - боковая нагрузка, характеризующая поступление с берегов;
    // // L - длина водохранилища;
    // var Q_plus = 1;
    // var Ci = 1;
    //
    //
    // /**
    //  * Основные функции
    //  */
    //
    // function SpeedTransform (Ui, L, S, Gi, Ci) {  // Скорость биохимической транформации соответствующего соединения Ci, Q+
    //     var Ri = (Ui - L - S - Gi) * Ci;
    //     return Ri;
    // }
    //
    // function SpeedPotrebleniya () {               // Выражение для удельных скоростей потребления Uij
    //     var Ui = Ki / ( 1 + Ci / Fi );
    //     return Ui;
    // }
    //
    // /* Уравнение для гидрохимических переменных */
    //
    // function GidrohimPeremennye() {
    //     var dCiWdt = W * Ri + Q_plus * C_plus_i - Q_minus * Ci + Ji * S + Ei * L;
    //     return dCiWdt;
    // }
    //
    // /* Уравнение водного баланса */
    //
    // /* Переменные уравнения водного баланса */
    //
    // var Qo = 1;         // - из реки Онон;
    // var Qt = 1;         // - из дренажного канала и реки Турга;
    // var Qp = 1;         // - на производство;
    // var Qn = 1;         // - на испарение;
    // var Qf = 1;         // - на фильтрацию;
    //
    //
    // function VodnogoBalansa() {
    //     var dWdt = Qo + Qt + Qp + Qn + Qf;
    //     return dWdt;
    // }
    //
    //
    // /**
    //  * i=1: Для рыбы elements
    //  * Рацион:
    //  * Фитопланктон: C4 (PH);
    //  * Зоопланктон: C2 (ZO);
    //  * Детрит: C8 (DE);
    //  * Макрофиты: C3 (MF);
    //  */
    //
    // var F1 = d12*C2 + d13*C3 + d14*C4 + d18*C8;
    // var U1 = U12 + U13 + U14 + U18;
    // /* Удельная скорость потребления */
    // var U12 = (k1*d12*C2)/(F1 + elements);
    // var U13 = (k1*d13*C3)/(F1 + elements);
    // var U14 = (k1*d14*C4)/(F1 + elements);
    // var U18 = (k1*d18*C8)/(F1 + elements);
    //
    // /* Скорость выделения */
    // var R1 = (d11*U1)/(1 + d12*U1) + (1 - d11/d12);
    // var L1 = R1*U1;
    //
    // /* Скорость смертности */
    // var S1 = V11 + V12*(elements/U1);
    //
    // /* Скорость выедания */
    // var Ct1 = 0; // В дальнейшем, когда будет учтен вылов рыбы человеком - бедет Ct1 != 0.
    //
    // /**
    //  *  Конец i=1: Для рыбы elements.
    //  */
    //
    //
    //
    // var test = SpeedTransform (5,L,S,3,3);
    // // $('#biogen__button').click(function () {
    // //     $('#biogen__answer').val(test);
    // // });


});

